// #include<stdio.h>

// int main(){
//     int arr[4][2][2]={1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16};//,9,10,11,12,13,14,15,16
// 	//int arr[10][5][3]; 
// 	void *pr1 = (void *)arr;//将三维数组变成一维,void*输出时需要强制类型转换为int*
// 	int *pr2 = (int *)arr;//将三维数组变成一维
// 	long *pr3 = arr;
//                 //将int数组变化为long型数组，当用指针调用时，比如*（pr3+1）的+1地址为long的，是int的二倍，所以会跳过一个数。
//                 //用pr3遍历会数组大小减半；
// 	char *pr4 = (char *)arr;//强制类型转换为char*，输出是应强制转化回来
// 	int *t[4];
//                 // 	t[0]=(int *)&arr[5];//三维数组中的第六个二维数组的第一个地址
//                 // 	t[1]=(int *)&arr[1][1][0];//三维数组中的第二个二维数组的第二个一维数组的第一个数的地址
//                 // 	t[2]=t[0];//和t[0]一样
//                 // //	t[3]=(int *)&t[0];//取的地址的地址，有问题
//                 //     t[3]=(int*)&(*t[0]);//修改后正确的
// 	t[0]=(int *)&arr[0];//三维数组的第一个地址
// 	t[1]=(int *)&arr[1][1][0];
// 	t[2]=t[0];
//     //t[3]=(int*)&(*t)[0];
//     t[3]=(int *)&t[0];//取的地址的地址
//                     // int**p;
//                     // p=(int*)&t[0];
//     // int**p;
//     // p=t[3];
//                     // printf("pr1=%d\n",*((int*)pr1+1));
//                     // printf("pr2=%d\n",*(pr2+1));
//                     // printf("pr3=%d\n",*(pr3+1));
//                     // printf("pr4=%d\n",*(int*)(pr4+2));
                    
//                     // for(int i=0;i<3;i++){
//                     // 	printf("%d\n",(*t[i]));
//                     // }
//                       printf("%d\n",**(int**)t[3]);


//     // printf("%d\n",*(*(*arr+1)));
//     // printf("%d\n",*(**arr+1));
//     // printf("%d\n",***(arr+1));
//     // printf("%d\n",*(&arr[1][0][0]+1));
//     // printf("%d\n",**(&arr[0][2]+1));
//     // printf("%d\n",*(**(&arr[1]+1)));
//     // printf("%d\n",*(***(&arr+1)-1));
//     // printf("pr4=%p\n",(int*)(pr4+2));
//     // printf("pr4=%p\n",(pr4));
//     //printf("%d\n",**p);
//     // printf("%d\n",*t[1]);
//     // printf("%d\n",*(*(t)));
//     // printf("%d\n",*(t[0]+1));
//     // printf("%d\n",*(*(&t[0]+1)+1));
//     // printf("%p\t%p\t%p\n",*(&t[0]+1)+1,*(t+1),*t);
//     // printf("%p\n",t[1]);
//     // printf("%p\n",((int(*)[4])t[1])+1);
//     // printf("%p\n",&arr[0]);
//     // printf("%p\n",&t);
//     // printf("%p\n",&t[0]);
//     // printf("%p\n",*((int(*)[3][4])t[2]+1)+1);
//     // printf("%p\n",t[3]);
//     //printf("%d\n",arr[2][1][1]);

// 	return 0;	
// }
// // t//B,A
// // t+1//A+72
// // t[0]+1//A+4
// // &t[0]+1//A+72
// // *(&t[0]+1)+1//A+72+4
// // t[1]//A+72
// // (int(*)[4])t[1]//A+72
// // ((int(*)[4])t[1])+1//A+72+16
// // *((int(*)[3][4])t[2]+1)+1//A+64
// // t[3]//B
// // t[3]-1//B-4

// // &arr[0][0][0]//A
// // &arr[0][0][1]//A+1*4
// // &arr[0][1][0]//A+3*4
// // &arr[1][0][0]//A+15*4
// // &arr[1][0][1]//A+16*4
// // &arr[0][1][1]//A+4*4
// // arr//A
// // **arr+1//A+1*4
// // *(*arr+1)//A+3*4
// // **(arr+1)//A+15*4
// // *(*arr+1)+1//A+4*4
// // *(*(arr+1))+1//A+16*4
// // &arr[1][0][0]+1//A+16*4
// // &arr[0][2]+1//A+9*4
// // &arr[1]+1//A+(15+15)*4=A+30*4
// // &arr+1//A+150*4
// // pr1+2//A+2*4
// // pr2+2//A+2*4
// // pr3+2//A+2*8
// // pr4+2//A+2*8
